#### VerticalAlignmentStyle Enumeration

---

|  |
| --- |
| See Also |

Declares the vertical alignment style of font.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public enum VerticalAlignmentStyle ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration VerticalAlignmentStyle ``` |

| Visual C++ |
| --- |
| ``` public enum class VerticalAlignmentStyle ``` |

# Members

| Member name | Description |
| --- | --- |
| Top | Alignment to top |
| Middle | Alignment to middle |
| Bottom | Alignment to bottom |

# See Also

Autodesk.Revit.DB Namespace